#include "../include/include.h"

int main()
{
    //Восстановленные параметры для периода измерений 23.03.2020–31.05.2020, Новосибирская область
    double αE = 0.999; // Параметр заражения между бессимптомной и восприимчивой группами населения
    double αI = 0.999; // Параметр заражения между инфицированным и восприимчивым населением
    double κ = 0.042;  // Частота появления симптомов у бессимптомных инфицированных
    double ρ = 0.952;  // Скорость восстановления выявленных бессимптомных случаев
    double β = 0.999;  // Скорость выздоровления инфицированных случаев
    double μ = 0.0188; // Смертность в результате COVID-19
    double cisol = 0;  // Коэффициент влияния индекса самоизоляции на заражаемость
    double y = 0;      // Скорость повторного заражения(устойчивый иммунитет)

    // Начальные условия
    double S0 = N - 99 - 24; // Это группа людей, которые подвержены риску заражения заболеванием, но пока не заразились.
    double E0 = 99;          // Это группа людей, которые заразились заболеванием, но еще не проявили симптомы.
    double I0 = 0;           // Это группа людей, которые уже проявили симптомы заболевания и могут заражать других.
    double R0 = 24;          // Это группа людей, которые выздоровели от заболевания и приобрели иммунитет к нему.
    double D0 = 0;           // Это группа людей, которые умерли от заболевания.

    euler_method(αE, αI, κ, ρ, β, μ, cisol, y, S0, E0, I0, R0, D0);
    print_res_in_file();
    
}